"""головний модуль задачі
- виводить на екран та в файл розрахункову таблицю
- виводить на екран первинні файли 
"""

import os
from process_data import create_gross_income
from data_service import show_goods, show_goods_circulations, get_goods, get_goods_circulations


MAIN_MENU = \
"""
~~~~~~~~~~~~~ ОБРОБКА ВАЛОВОГО ДОХОДУ УНІВЕРМАГУ НА ПОТОЧНИЙ РІК ~~~~~~~~~~~    

1 - вивід валового доходу на екран
2 - запис валового доходу в файл
3 - вивід списка товарообіга універмагу
4 - вивід списка товарних груп
0 - завершення роботи
-------------------------------------------
"""

TITLE = "ВАЛОВИЙ ДОХІД УНІВЕРМАГУ НА ПОТОЧНИЙ РІК"

HEADER = \
""" 
==============================================================================================================
| Найменування   |   Рік   |        Товарообіг,тис.грн        |  Торгова    |     Валовий дохід,тис.грн.     |
| товарної групи |=========|==================================|  скидка, %  |================================|
|                |         |   План   |  Очіковане виконання  |             |  План  |  Очіковане виконання  |
==============================================================================================================
"""

FOOTER = \
'''
==============================================================================================================

'''

STOP MESSAGE = 'Для продовження натисніть <Enter>'

def show_gross_income(gross_income_list)
    """виводить таблицю валового доходу

    Args:
        gross_income_list ([type]): список валового доходу
    """
    print(f"\n\n{TITLE:^111}")
    print(HEADER)

    for gross_income in gross_income_list:
        print(f"{gross_income[]})

print(MAIN_MENU)


command_number = input("Введіть номер команди: ")